Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAA288.atdf
         <register caption="CAN Module Message Index Register " name="C1FIFOCI20" offset="0x880" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C2FIFOCI20" offset="0x1880" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN FIFO Control Register " name="C1FIFOCON21" offset="0x890" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON21__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON21__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON21__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit(3)" mask="0x00000010" name="TXERR" values="C1FIFOCON21__TXERR" />
            <bitfield caption="Message Lost Arbitration bit(3)" mask="0x00000020" name="TXLARB" values="C1FIFOCON21__TXLARB" />
            <bitfield caption="Message Aborted bit(2)" mask="0x00000040" name="TXABAT" values="C1FIFOCON21__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON21__TXEN" />
            <bitfield caption="Store Message Data Only bit(1)" mask="0x00001000" name="DONLY" values="C1FIFOCON21__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON21__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON21__FRESET" />
            <bitfield caption="FIFO Size bits(1)" mask="0x001F0000" name="FSIZE" values="C1FIFOCON21__FSIZE" />
         </register>
         <register caption="CAN FIFO Control Register " name="C2FIFOCON21" offset="0x1890" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C2FIFOCON21__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C2FIFOCON21__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C2FIFOCON21__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit(3)" mask="0x00000010" name="TXERR" values="C2FIFOCON21__TXERR" />
            <bitfield caption="Message Lost Arbitration bit(3)" mask="0x00000020" name="TXLARB" values="C2FIFOCON21__TXLARB" />
            <bitfield caption="Message Aborted bit(2)" mask="0x00000040" name="TXABAT" values="C2FIFOCON21__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C2FIFOCON21__TXEN" />
            <bitfield caption="Store Message Data Only bit(1)" mask="0x00001000" name="DONLY" values="C2FIFOCON21__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C2FIFOCON21__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C2FIFOCON21__FRESET" />
            <bitfield caption="FIFO Size bits(1)" mask="0x001F0000" name="FSIZE" values="C2FIFOCON21__FSIZE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT21" offset="0x8a0" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit(1)" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT21__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit(1)" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT21__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit(1)" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT21__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT21__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit(1)" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT21__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT21__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit(1)" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT21__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT21__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT21__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT21__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT21__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT21__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT21__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT21__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C2FIFOINT21" offset="0x18a0" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit(1)" mask="0x00000001" name="RXNEMPTYIF" values="C2FIFOINT21__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit(1)" mask="0x00000002" name="RXHALFIF" values="C2FIFOINT21__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit(1)" mask="0x00000004" name="RXFULLIF" values="C2FIFOINT21__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C2FIFOINT21__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit(1)" mask="0x00000100" name="TXEMPTYIF" values="C2FIFOINT21__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" mask="0x00000200" name="TXHALFIF" values="C2FIFOINT21__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit(1)" mask="0x00000400" name="TXNFULLIF" values="C2FIFOINT21__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C2FIFOINT21__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C2FIFOINT21__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C2FIFOINT21__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C2FIFOINT21__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C2FIFOINT21__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C2FIFOINT21__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C2FIFOINT21__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C1FIFOUA21" offset="0x8b0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C2FIFOUA21" offset="0x18b0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN Module Message Index Register " name="C1FIFOCI21" offset="0x8c0" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C2FIFOCI21" offset="0x18c0" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN FIFO Control Register " name="C1FIFOCON22" offset="0x8d0" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON22__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON22__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON22__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit(3)" mask="0x00000010" name="TXERR" values="C1FIFOCON22__TXERR" />
            <bitfield caption="Message Lost Arbitration bit(3)" mask="0x00000020" name="TXLARB" values="C1FIFOCON22__TXLARB" />
            <bitfield caption="Message Aborted bit(2)" mask="0x00000040" name="TXABAT" values="C1FIFOCON22__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON22__TXEN" />
            <bitfield caption="Store Message Data Only bit(1)" mask="0x00001000" name="DONLY" values="C1FIFOCON22__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON22__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON22__FRESET" />
            <bitfield caption="FIFO Size bits(1)" mask="0x001F0000" name="FSIZE" values="C1FIFOCON22__FSIZE" />
         </register>
         <register caption="CAN FIFO Control Register " name="C2FIFOCON22" offset="0x18d0" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C2FIFOCON22__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C2FIFOCON22__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C2FIFOCON22__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit(3)" mask="0x00000010" name="TXERR" values="C2FIFOCON22__TXERR" />
            <bitfield caption="Message Lost Arbitration bit(3)" mask="0x00000020" name="TXLARB" values="C2FIFOCON22__TXLARB" />
            <bitfield caption="Message Aborted bit(2)" mask="0x00000040" name="TXABAT" values="C2FIFOCON22__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C2FIFOCON22__TXEN" />
            <bitfield caption="Store Message Data Only bit(1)" mask="0x00001000" name="DONLY" values="C2FIFOCON22__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C2FIFOCON22__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C2FIFOCON22__FRESET" />
            <bitfield caption="FIFO Size bits(1)" mask="0x001F0000" name="FSIZE" values="C2FIFOCON22__FSIZE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT22" offset="0x8e0" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit(1)" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT22__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit(1)" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT22__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit(1)" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT22__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT22__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit(1)" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT22__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT22__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit(1)" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT22__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT22__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT22__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT22__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT22__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT22__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT22__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT22__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C2FIFOINT22" offset="0x18e0" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit(1)" mask="0x00000001" name="RXNEMPTYIF" values="C2FIFOINT22__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit(1)" mask="0x00000002" name="RXHALFIF" values="C2FIFOINT22__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit(1)" mask="0x00000004" name="RXFULLIF" values="C2FIFOINT22__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C2FIFOINT22__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit(1)" mask="0x00000100" name="TXEMPTYIF" values="C2FIFOINT22__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" mask="0x00000200" name="TXHALFIF" values="C2FIFOINT22__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit(1)" mask="0x00000400" name="TXNFULLIF" values="C2FIFOINT22__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C2FIFOINT22__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C2FIFOINT22__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C2FIFOINT22__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C2FIFOINT22__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C2FIFOINT22__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C2FIFOINT22__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C2FIFOINT22__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C1FIFOUA22" offset="0x8f0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C2FIFOUA22" offset="0x18f0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
