Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAA288.atdf
      <value-group caption="PHY ID Monitoring Enable bit" name="USBCRCON__PHYIDEN">
         <value caption="Enable monitoring of the ID bit from the USB PHY" name="" value="0x1" />
         <value caption="Disable monitoring of the ID bit from the USB PHY" name="" value="0x0" />
      </value-group>
      <value-group caption="USB ID Value bit" name="USBCRCON__USBIDVAL">
         <value caption="ID override value is 1" name="" value="0x1" />
         <value caption="ID override value is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="USB ID Override Enable bit" name="USBCRCON__USBIDOVEN">
         <value caption="Enable use of USBIDVAL bit" name="" value="0x1" />
         <value caption="Disable use of USBIDVAL and instead use the PHY value" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Activity Status bit" name="USBCRCON__USBWK">
         <value caption="Connect" name="" value="0x1" />
         <value caption="No activity detected on USB" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Resume Flag bit" name="USBCRCON__USBRF">
         <value caption="Resume from Suspend state. Device wake-up activity can be started." name="" value="0x1" />
         <value caption="No Resume activity detected during Suspend" name="" value="0x0" />
      </value-group>
      <value-group caption="USB General Interrupt Flag bit" name="USBCRCON__USBIF">
         <value caption="An event on the USB Bus has occurred" name="" value="0x1" />
         <value caption="No interrupt from USB module or interrupts have not been enabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02674" name="WDT" version="">
      <register-group name="WDT">
         <register caption="Watchdog Timer Control Register" name="WDTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x00000001" name="WDTWINEN" values="WDTCON__WDTWINEN" />
            <bitfield mask="0x0000003E" name="SLPDIV" />
            <bitfield mask="0x000000C0" name="CLKSEL" />
            <bitfield mask="0x00001F00" name="RUNDIV" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="ON" values="WDTCON__ON" />
            <bitfield mask="0xFFFF0000" name="WDTCLRKEY" />
         </register>
      </register-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="WDTCON__WDTWINEN">
         <value caption="Enable windowed Watchdog Timer" name="" value="0x1" />
         <value caption="Disable windowed Watchdog Timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="WDTCON__ON">
         <value caption="The WDT is enabled" name="" value="0x1" />
         <value caption="The WDT is disabled" name="" value="0x0" />
      </value-group>
   </module>
</modules>
<pinouts/>
</avr-tools-device-file>
